In [28]:
# main libraries
import pandas as pd
from matplotlib import pyplot as py # try to use seaborn instead... 

# alternative libraries
import numpy as np # alternative to pandas
import seaborn as sns # (recommended) alternative to matplotlib

# other
# import os
import statistics # statistical functions
import re
# import random 
# import itertools
# import math 
# from sklearn import # machine learning library

'''
Sections:
-Libraries
-EDA
-Cleaning
-Data Manipulation
-Visualisation

# Casey's source for EDA: https://github.com/caseynator123/EDP_assigment2/blob/main/eda/eda.ipynb
'''

"\nSections:\n-Libraries\n-EDA\n-Cleaning\n-Data Manipulation\n-Visualisation\n\n# Casey's source for EDA: https://github.com/caseynator123/EDP_assigment2/blob/main/eda/eda.ipynb\n"

# Early Data Exploration

In [29]:
# read in data
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv"

data = pd.read_csv(url, sep="\t")

In [30]:
# numerical EDA stage 1
display(data)
data.describe()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [31]:
data

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

# DATA CLEANING

In [32]:
# Errors to look out for... range errors, NaN values (Done), format errors

# NaN values
data.isna().sum()

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64

In [55]:
# https://stackoverflow.com/questions/32464280/how-to-convert-currency-column-with-and-to-numbers
# format errors (could automate this by using regex to search for all non numerical/decimal point symbols...)

#use regex to check for formatting
#i.e., from Casey: books[~books["ISBN"].str.match(r"^(?=(?:\D*\d){9,10})|\d{9}X")]

print(data.dtypes)
data["item_numerical_price"] = data["item_price"].replace(r'[\$]','', regex=True).astype(float)

#alternatively, when dealing with strings and want to shortcut it
data["item_numerical_price"] = data["item_price"].str.replace("$", "").astype(float)
data["item_numerical_price"]

# https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html
#can also index on the strings like so, i.e., for last three letters, or ?use conditions?: 
# ... BUT TBH, USE REGEX FOR ANY LEVEL OF COMPLEXITY
data["item_name"].str[-3:]

order_id                  int64
quantity                  int64
item_name                object
choice_description       object
item_price               object
item_numerical_price    float64
dtype: object

0       lsa
1       zze
2       tar
3       lsa
4       owl
       ...
4617    ito
4618    ito
4619    owl
4620    owl
4621    owl
Name: item_name, Length: 4622, dtype: object

In [34]:
# range errors... (i.e., price 1000)?

In [35]:
# inconsistency errors (i.e., unit price 1, quantity 2, total price 3)?

In [50]:
# casefolding
# .str.upper()
data["item_name"].str.lower()

0                chips and fresh tomato salsa
1                                        izze
2                            nantucket nectar
3       chips and tomatillo-green chili salsa
4                                chicken bowl
                        ...
4617                            steak burrito
4618                            steak burrito
4619                       chicken salad bowl
4620                       chicken salad bowl
4621                       chicken salad bowl
Name: item_name, Length: 4622, dtype: object

In [36]:
# duplication errors? only on primary keys or candidate keys if not all columns
# data[data["order_id"].duplicated()] (turns out order_id is not the primary key)\
data.loc[data.duplicated()]

data[["order_id", "item_name"]].drop_duplicates()

      order_id                              item_name
0            1           Chips and Fresh Tomato Salsa
1            1                                   Izze
2            1                       Nantucket Nectar
3            1  Chips and Tomatillo-Green Chili Salsa
4            2                           Chicken Bowl
...        ...                                    ...
4614      1831                          Bottled Water
4615      1832                     Chicken Soft Tacos
4616      1832                    Chips and Guacamole
4617      1833                          Steak Burrito
4619      1834                     Chicken Salad Bowl

[4292 rows x 2 columns]

# Data Manipulation

In [37]:
# sorting?
# biggest?
# smallest?
# counting?
# mean, median, mode, sum etc.?
# indexing, using .at, .loc etc. 
# group by?

data["quantity"].max()
data["quantity"].min()
data["quantity"].mean()
data["quantity"].median()
data["quantity"].mode()
data["quantity"].count()
data.quantity.std() #can use .col_name instead of ["col_name"]
data.quantity.unique()
data.quantity.idxmax()
data.quantity.idxmin()

data.quantity.value_counts() # This gives the distribution of quantity, so highly useful

quantity
1     4355
2      224
3       28
4       10
5        1
15       1
7        1
8        1
10       1
Name: count, dtype: int64

In [38]:
# sorting
data.sort_values(by="quantity", ascending=False)

,order_id,quantity,item_name,choice_description,item_price,item_numerical_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25,44.25
4152,1660,10,Bottled Water,NaN,$15.00,15.00
3887,1559,8,Side of Chips,NaN,$13.52,13.52
3599,1443,7,Bottled Water,NaN,$10.50,10.50
2441,970,5,Bottled Water,NaN,$7.50,7.50
...,...,...,...,...,...,...
1592,645,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25,11.25
1593,645,1,Chips and Tomatillo Green Chili Salsa,NaN,$2.95,2.95
1594,646,1,Carnitas Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$9.25,9.25
1595,646,1,Chicken Burrito,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$11.25,11.25
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75

In [39]:
# group by 
data.groupby(by="item_name")

#typically with .sum() at the end (ALWAYS NEEDS AN AGGREGATE FUNCTION TO PAIR)
#.counts() counts all non-null entities (WORKS WONDERS WITH GROUP BY)
#.nunique() to count the number of unique/distinct values
#.value_counts() returns series for the count of each unique entity (AVOID???) (DOESN'T WORK WITH SORTING)
#source: https://stackoverflow.com/questions/55494028/when-to-use-count-and-value-counts-in-pandas

data.groupby(by="item_name").count().sort_values(by="order_id", ascending=False).head(1)

,order_id,quantity,choice_description,item_price,item_numerical_price
item_name,,,,,
Chicken Bowl,726,726,726,726,726

In [40]:
# string matching in pandas
# MAKE SURE TO APPLY TEXT PREPROCESSING FIRST, particularly casefolding... maybe even fuzzy matching

data[data.item_name.str.contains(r'([a-zA-Z])\1', regex=True, na=False)] # regex solution
data[data.item_name.str.contains('Drink', regex=True, na=False)] # no regex for pure string sequences

#data[data.item_name.str.extract(r'([a-zA-Z])\1')]  # find a way to extract the regex string pattern maybe?

''' 
alternatively, use the .isin method
step 1) create a set of relevant names

step 2) apply this
.isin(set)
and voila!

This shows however, I need to do data exploration before just assuming regex is the answer, 
and ALWAYS consider what could go wrong
'''

C:\Users\andyd\AppData\Local\Temp\ipykernel_21628\1788340056.py:4: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  data[data.item_name.str.contains(r'([a-zA-Z])\1', regex=True, na=False)] # regex solution

' \nalternatively, use the .isin method\nstep 1) create a set of relevant names\n\nstep 2) apply this\n.isin(set)\nand voila!\n\nThis shows however, I need to do data exploration before just assuming regex is the answer, \nand ALWAYS consider what could go wrong\n'

In [41]:
# Merging two data frames!!!
right_data = pd.read_csv(url, sep="\t")

# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html
wierd_data = data.merge(right_data, on="order_id")#, how='optional, but inner, outer, right etc.')

In [42]:
# Time Complexity Analysis
from time import time

def time_this(func):
    def wrap_func(*args, **kwargs):
        t1 = time()
        result = func(*args, **kwargs)
        t2 = time()
        print(f"Function {func.__name__!r} executed in {(t2-t1):.4f}s")
        return result

    return wrap_func

@time_this
def some_function():
    print("Test")

some_function()

Test
Function 'some_function' executed in 0.0010s

In [49]:
data_copy = data.copy()

# VECTORISED/SPEEDY CASE WHEN
# even orders double their quantity, odd orders halve
data_copy["special"] = np.where(
    data_copy["order_id"] % 2 == 0, data["quantity"] * 2, data["quantity"]/2
) #condition, satisfaction case, unsatisfaction case

data_copy[["order_id", "quantity", "special"]]

      order_id  quantity  special
0            1         1      0.5
1            1         1      0.5
2            1         1      0.5
3            1         1      0.5
4            2         2      4.0
...        ...       ...      ...
4617      1833         1      0.5
4618      1833         1      0.5
4619      1834         1      2.0
4620      1834         1      2.0
4621      1834         1      2.0

[4622 rows x 3 columns]

# Visualisation